https://towardsdatascience.com/11-tricks-to-master-values-sorting-in-pandas-7f2cfbf19730

In [4]:
import pandas as pd
df = pd.DataFrame({
    'product': ['keyboard', 'mouse', 'desk', 'monitor', 'chair'],
    'category': ['C', 'C', 'O', 'C', 'O'],
    'year': [2002, 2002, 2005, 2001, 2003],
    'cost': ['$52', '$24', '$250', '$500', '$150'],
    'promotion_time': ['20hr', '30hr', '20hr', '20hr', '2hr'],
})

In [5]:
df['year'].sort_values()

3    2001
0    2002
1    2002
4    2003
2    2005
Name: year, dtype: int64

In [6]:
df['year'].sort_values(ascending=False)

2    2005
4    2003
0    2002
1    2002
3    2001
Name: year, dtype: int64

In [7]:
df.sort_values('year')
# same as df.sort_values(by='year')

    product category  year  cost promotion_time
3   monitor        C  2001  $500           20hr
0  keyboard        C  2002   $52           20hr
1     mouse        C  2002   $24           30hr
4     chair        O  2003  $150            2hr
2      desk        O  2005  $250           20hr

In [8]:
df.sort_values(['category', 'year'], ascending=[True, False])

    product category  year  cost promotion_time
0  keyboard        C  2002   $52           20hr
1     mouse        C  2002   $24           30hr
3   monitor        C  2001  $500           20hr
2      desk        O  2005  $250           20hr
4     chair        O  2003  $150            2hr

In [9]:
df.sort_values(
    'cost', 
    key=lambda val: val.str.replace('$', '').astype('float64')
)

C:\Users\biegertm\AppData\Local\Temp/ipykernel_21724/1821010.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  key=lambda val: val.str.replace('$', '').astype('float64')

    product category  year  cost promotion_time
1     mouse        C  2002   $24           30hr
0  keyboard        C  2002   $52           20hr
4     chair        O  2003  $150            2hr
2      desk        O  2005  $250           20hr
3   monitor        C  2001  $500           20hr

In [10]:
df = pd.DataFrame({
    'product': ['keyboard', 'mouse', 'desk', 'monitor', 'chair'],
    'category': ['C', 'C', 'O', 'C', 'O'],
    'year': [2002, 2002, 2005, 2001, 2003],
    'cost': ['$52', '$24', '$250', '$500', '$150'],
    'promotion_time': ['20hr', '30hr', '20hr', '20hr', '2hr'],
})

In [11]:
def sort_by_cost_time(x):
    if x.name == 'cost':
        return x.str.replace('$', '').astype('float64')
    elif x.name == 'promotion_time':
        return x.str.replace('hr', '').astype('int')
    else:
        return x
# Pass the function to the key argument
df.sort_values(
   ['year', 'promotion_time', 'cost'], 
   key=sort_by_cost_time
)

C:\Users\biegertm\AppData\Local\Temp/ipykernel_21724/694544415.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  return x.str.replace('$', '').astype('float64')

    product category  year  cost promotion_time
3   monitor        C  2001  $500           20hr
0  keyboard        C  2002   $52           20hr
1     mouse        C  2002   $24           30hr
4     chair        O  2003  $150            2hr
2      desk        O  2005  $250           20hr

In [13]:
df = pd.DataFrame({
    'cloth_id': [1001, 1002, 1003, 1004, 1005, 1006],
    'size': ['S', 'XL', 'M', 'XS', 'L', 'S'],
})

from pandas.api.types import CategoricalDtype

In [14]:
cat_size_order = CategoricalDtype(
    ['XS', 'S', 'M', 'L', 'XL'], 
    ordered=True
)

In [15]:
df['size'] = df['size'].astype(cat_size_order)
df['size']

0     S
1    XL
2     M
3    XS
4     L
5     S
Name: size, dtype: category
Categories (5, object): ['XS' < 'S' < 'M' < 'L' < 'XL']

In [16]:
df.sort_values('size')

   cloth_id size
3      1004   XS
0      1001    S
5      1006    S
2      1003    M
4      1005    L
1      1002   XL

In [18]:
import numpy as np

df = pd.DataFrame({
    'id': [4, 2, 3, np.nan, 6, 5],
    'name': ['A', 'B', 'C', 'D', 'E', 'F'],
})
df.sort_values('id')

    id name
1  2.0    B
2  3.0    C
0  4.0    A
5  5.0    F
4  6.0    E
3  NaN    D

In [19]:
df.sort_values('id', na_position='first')

    id name
3  NaN    D
1  2.0    B
2  3.0    C
0  4.0    A
5  5.0    F
4  6.0    E

In [21]:
df.sort_values('id', inplace=True)
print(df)

    id name
1  2.0    B
2  3.0    C
0  4.0    A
5  5.0    F
4  6.0    E
3  NaN    D

In [22]:
df.sort_values('id',ignore_index=True)

    id name
0  2.0    B
1  3.0    C
2  4.0    A
3  5.0    F
4  6.0    E
5  NaN    D